const data = {
    "result": {
        "categories": {
            "Аксессуары": [
                "Рюкзаки",
                "Сумки",
                "Часы наручные"
            ],
            "Белье": [
                "Боди",
                "Бордшорты",
                "Бюстгальтеры",
                "Бюстье",
                "Колготки",
                "Лифы для купальника",
                "Монокини",
                "Носки",
                "Плавки",
                "Пояса для чулок",
                "Раздельные купальники",
                "Слитные купальники",
                "Трусы"
            ],
            "Белье для малышей": [
                "Носки для малышей"
            ],
            "Красота": [
                "Щетки косметические"
            ],
            "Одежда": [
                "Блузки",
                "Блузки-боди",
                "Бомберы",
                "Брюки",
                "Ветровки",
                "Водолазки",
                "Джеггинсы",
                "Джемперы",
                "Джинсы",
                "Жакеты",
                "Жилеты",
                "Капри",
                "Кардиганы",
                "Комбинезоны",
                "Костюмы",
                "Косухи",
                "Кофты",
                "Куртки",
                "Леггинсы",
                "Лонгсливы",
                "Ночные сорочки",
                "Пальто",
                "Парки",
                "Пиджаки",
                "Пижамы",
                "Платья",
                "Плащи",
                "Пуловеры",
                "Пуховики",
                "Рубашки",
                "Сарафаны",
                "Свитеры",
                "Свитшоты",
                "Толстовки",
                "Топы",
                "Туники",
                "Футболки",
                "Футболки-поло",
                "Халаты домашние",
                "Худи",
                "Шорты",
                "Юбки"
            ]
        }
    }
}

const output = [];
const categoriesList = data.result.categories;

let j = Object.keys(categoriesList).length;

let i = 0;

for (const category in categoriesList) {
    const children = categoriesList[category].map((child, index) => {
        return {children_value: j++, children_label: child, parent_key: i}
    })
    output.push({parent_value: i++, parent_label: category, children: children})
}
